fuzzhawk/esp32_chaos/sdkconfig.defaults
# chaosOS build defaults. `idf.py set-target esp32s3` then `idf.py build`.

# --- Target / flash / PSRAM (ESP32-S3R8: 8MB PSRAM, 32MB flash) ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Octal PSRAM at 80MHz — required for a smooth 466x466 framebuffer.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Custom partition table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- CPU: run both LX7 cores flat out for the UI + sim workload ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# --- Main task gets a roomy stack (LVGL object trees live here at boot) ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- LVGL: 16-bit color to match the panel's RGB565 path ---
CONFIG_LV_COLOR_DEPTH_16=y
# esp_lcd sends RGB565 big-endian, so LVGL must swap the two bytes itself.
# (This is the LVGL-8 equivalent of esp_lvgl_port's swap_bytes flag.)
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
# Give LVGL its heap in PSRAM and a generous slice — big canvases live there.
CONFIG_LV_MEM_SIZE_KILOBYTES=64
# Fonts used across the chaosOS UI.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
# Draw the app framebuffers/canvases used by the cellular-automata app.
CONFIG_LV_USE_CANVAS=y

# Quieter logs once things work; bump to INFO/DEBUG while bringing up hardware.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
